Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/dwdt.h
/*
 * Component description for DWDT
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_DWDT_COMPONENT_H_
#define _PIC32CXMTC_DWDT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DWDT                                         */
/* ************************************************************************** */

/* -------- DWDT_WDT1_CR : (DWDT Offset: 0x00) ( /W 32) Watchdog 1 Control Register -------- */
#define DWDT_WDT1_CR_WDRSTT_Pos               _UINT32_(0)                                          /* (DWDT_WDT1_CR) Watchdog Restart Position */
#define DWDT_WDT1_CR_WDRSTT_Msk               (_UINT32_(0x1) << DWDT_WDT1_CR_WDRSTT_Pos)           /* (DWDT_WDT1_CR) Watchdog Restart Mask */
#define DWDT_WDT1_CR_WDRSTT(value)            (DWDT_WDT1_CR_WDRSTT_Msk & (_UINT32_(value) << DWDT_WDT1_CR_WDRSTT_Pos)) /* Assigment of value for WDRSTT in the DWDT_WDT1_CR register */
#define DWDT_WDT1_CR_LOCKMR_Pos               _UINT32_(4)                                          /* (DWDT_WDT1_CR) Lock Mode Register Write Access Position */
#define DWDT_WDT1_CR_LOCKMR_Msk               (_UINT32_(0x1) << DWDT_WDT1_CR_LOCKMR_Pos)           /* (DWDT_WDT1_CR) Lock Mode Register Write Access Mask */
#define DWDT_WDT1_CR_LOCKMR(value)            (DWDT_WDT1_CR_LOCKMR_Msk & (_UINT32_(value) << DWDT_WDT1_CR_LOCKMR_Pos)) /* Assigment of value for LOCKMR in the DWDT_WDT1_CR register */
#define DWDT_WDT1_CR_KEY_Pos                  _UINT32_(24)                                         /* (DWDT_WDT1_CR) Password Position */
#define DWDT_WDT1_CR_KEY_Msk                  (_UINT32_(0xFF) << DWDT_WDT1_CR_KEY_Pos)             /* (DWDT_WDT1_CR) Password Mask */
#define DWDT_WDT1_CR_KEY(value)               (DWDT_WDT1_CR_KEY_Msk & (_UINT32_(value) << DWDT_WDT1_CR_KEY_Pos)) /* Assigment of value for KEY in the DWDT_WDT1_CR register */
#define   DWDT_WDT1_CR_KEY_PASSWD_Val         _UINT32_(0xA5)                                       /* (DWDT_WDT1_CR) Writing any other value in this field aborts the write operation.  */
#define DWDT_WDT1_CR_KEY_PASSWD               (DWDT_WDT1_CR_KEY_PASSWD_Val << DWDT_WDT1_CR_KEY_Pos) /* (DWDT_WDT1_CR) Writing any other value in this field aborts the write operation. Position  */
#define DWDT_WDT1_CR_Msk                      _UINT32_(0xFF000011)                                 /* (DWDT_WDT1_CR) Register Mask  */


/* -------- DWDT_WDT1_MR : (DWDT Offset: 0x04) (R/W 32) Watchdog 1 Mode Register -------- */
#define DWDT_WDT1_MR_PERIODRST_Pos            _UINT32_(4)                                          /* (DWDT_WDT1_MR) Watchdog Overflow Period Reset Enable Position */
#define DWDT_WDT1_MR_PERIODRST_Msk            (_UINT32_(0x1) << DWDT_WDT1_MR_PERIODRST_Pos)        /* (DWDT_WDT1_MR) Watchdog Overflow Period Reset Enable Mask */
#define DWDT_WDT1_MR_PERIODRST(value)         (DWDT_WDT1_MR_PERIODRST_Msk & (_UINT32_(value) << DWDT_WDT1_MR_PERIODRST_Pos)) /* Assigment of value for PERIODRST in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_RPTHRST_Pos              _UINT32_(5)                                          /* (DWDT_WDT1_MR) Repeat Threshold Reset Enable Position */
#define DWDT_WDT1_MR_RPTHRST_Msk              (_UINT32_(0x1) << DWDT_WDT1_MR_RPTHRST_Pos)          /* (DWDT_WDT1_MR) Repeat Threshold Reset Enable Mask */
#define DWDT_WDT1_MR_RPTHRST(value)           (DWDT_WDT1_MR_RPTHRST_Msk & (_UINT32_(value) << DWDT_WDT1_MR_RPTHRST_Pos)) /* Assigment of value for RPTHRST in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_WDNRSTDIS_Pos            _UINT32_(9)                                          /* (DWDT_WDT1_MR) Watchdog Reset NRST Pin Disable Position */
#define DWDT_WDT1_MR_WDNRSTDIS_Msk            (_UINT32_(0x1) << DWDT_WDT1_MR_WDNRSTDIS_Pos)        /* (DWDT_WDT1_MR) Watchdog Reset NRST Pin Disable Mask */
#define DWDT_WDT1_MR_WDNRSTDIS(value)         (DWDT_WDT1_MR_WDNRSTDIS_Msk & (_UINT32_(value) << DWDT_WDT1_MR_WDNRSTDIS_Pos)) /* Assigment of value for WDNRSTDIS in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_WDDIS_Pos                _UINT32_(12)                                         /* (DWDT_WDT1_MR) Watchdog Disable Position */
#define DWDT_WDT1_MR_WDDIS_Msk                (_UINT32_(0x1) << DWDT_WDT1_MR_WDDIS_Pos)            /* (DWDT_WDT1_MR) Watchdog Disable Mask */
#define DWDT_WDT1_MR_WDDIS(value)             (DWDT_WDT1_MR_WDDIS_Msk & (_UINT32_(value) << DWDT_WDT1_MR_WDDIS_Pos)) /* Assigment of value for WDDIS in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_WDIDLEHLT_Pos            _UINT32_(28)                                         /* (DWDT_WDT1_MR) Watchdog Idle Halt Position */
#define DWDT_WDT1_MR_WDIDLEHLT_Msk            (_UINT32_(0x1) << DWDT_WDT1_MR_WDIDLEHLT_Pos)        /* (DWDT_WDT1_MR) Watchdog Idle Halt Mask */
#define DWDT_WDT1_MR_WDIDLEHLT(value)         (DWDT_WDT1_MR_WDIDLEHLT_Msk & (_UINT32_(value) << DWDT_WDT1_MR_WDIDLEHLT_Pos)) /* Assigment of value for WDIDLEHLT in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_WDDBG0HLT_Pos            _UINT32_(29)                                         /* (DWDT_WDT1_MR) Watchdog Core 0 Debug Halt Position */
#define DWDT_WDT1_MR_WDDBG0HLT_Msk            (_UINT32_(0x1) << DWDT_WDT1_MR_WDDBG0HLT_Pos)        /* (DWDT_WDT1_MR) Watchdog Core 0 Debug Halt Mask */
#define DWDT_WDT1_MR_WDDBG0HLT(value)         (DWDT_WDT1_MR_WDDBG0HLT_Msk & (_UINT32_(value) << DWDT_WDT1_MR_WDDBG0HLT_Pos)) /* Assigment of value for WDDBG0HLT in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_WDDBG1HLT_Pos            _UINT32_(30)                                         /* (DWDT_WDT1_MR) Watchdog Core 1 Debug Halt Position */
#define DWDT_WDT1_MR_WDDBG1HLT_Msk            (_UINT32_(0x1) << DWDT_WDT1_MR_WDDBG1HLT_Pos)        /* (DWDT_WDT1_MR) Watchdog Core 1 Debug Halt Mask */
#define DWDT_WDT1_MR_WDDBG1HLT(value)         (DWDT_WDT1_MR_WDDBG1HLT_Msk & (_UINT32_(value) << DWDT_WDT1_MR_WDDBG1HLT_Pos)) /* Assigment of value for WDDBG1HLT in the DWDT_WDT1_MR register */
#define DWDT_WDT1_MR_Msk                      _UINT32_(0x70001230)                                 /* (DWDT_WDT1_MR) Register Mask  */


