Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/dwdt.h
/* -------- DWDT_WDT1_IDR : (DWDT Offset: 0x18) ( /W 32) Watchdog 1 Interrupt Disable Register -------- */
#define DWDT_WDT1_IDR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT1_IDR) Overflow Period Interrupt Disable Position */
#define DWDT_WDT1_IDR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IDR_PERINT_Pos)          /* (DWDT_WDT1_IDR) Overflow Period Interrupt Disable Mask */
#define DWDT_WDT1_IDR_PERINT(value)           (DWDT_WDT1_IDR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT1_IDR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT1_IDR register */
#define DWDT_WDT1_IDR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT1_IDR) Reload Repeat Period Interrupt Disable Position */
#define DWDT_WDT1_IDR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT1_IDR_RPTHINT_Pos)         /* (DWDT_WDT1_IDR) Reload Repeat Period Interrupt Disable Mask */
#define DWDT_WDT1_IDR_RPTHINT(value)          (DWDT_WDT1_IDR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT1_IDR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT1_IDR register */
#define DWDT_WDT1_IDR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT1_IDR) Interrupt Level Threshold Interrupt Disable Position */
#define DWDT_WDT1_IDR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IDR_LVLINT_Pos)          /* (DWDT_WDT1_IDR) Interrupt Level Threshold Interrupt Disable Mask */
#define DWDT_WDT1_IDR_LVLINT(value)           (DWDT_WDT1_IDR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT1_IDR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT1_IDR register */
#define DWDT_WDT1_IDR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT1_IDR) Reload Command Error Interrupt Disable Position */
#define DWDT_WDT1_IDR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT1_IDR_RLDERR_Pos)          /* (DWDT_WDT1_IDR) Reload Command Error Interrupt Disable Mask */
#define DWDT_WDT1_IDR_RLDERR(value)           (DWDT_WDT1_IDR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT1_IDR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT1_IDR register */
#define DWDT_WDT1_IDR_Msk                     _UINT32_(0x00000027)                                 /* (DWDT_WDT1_IDR) Register Mask  */


/* -------- DWDT_WDT1_ISR : (DWDT Offset: 0x1C) ( R/ 32) Watchdog 1 Interrupt Status Register -------- */
#define DWDT_WDT1_ISR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT1_ISR) Overflow Period Status (cleared on read) Position */
#define DWDT_WDT1_ISR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_ISR_PERINT_Pos)          /* (DWDT_WDT1_ISR) Overflow Period Status (cleared on read) Mask */
#define DWDT_WDT1_ISR_PERINT(value)           (DWDT_WDT1_ISR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT1_ISR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT1_ISR register */
#define DWDT_WDT1_ISR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT1_ISR) Reload Repeat Period Status (cleared on read) Position */
#define DWDT_WDT1_ISR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT1_ISR_RPTHINT_Pos)         /* (DWDT_WDT1_ISR) Reload Repeat Period Status (cleared on read) Mask */
#define DWDT_WDT1_ISR_RPTHINT(value)          (DWDT_WDT1_ISR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT1_ISR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT1_ISR register */
#define DWDT_WDT1_ISR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT1_ISR) Interrupt Level Threshold Status (cleared on read) Position */
#define DWDT_WDT1_ISR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_ISR_LVLINT_Pos)          /* (DWDT_WDT1_ISR) Interrupt Level Threshold Status (cleared on read) Mask */
#define DWDT_WDT1_ISR_LVLINT(value)           (DWDT_WDT1_ISR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT1_ISR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT1_ISR register */
#define DWDT_WDT1_ISR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT1_ISR) Reload Command Error Status (cleared on read) Position */
#define DWDT_WDT1_ISR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT1_ISR_RLDERR_Pos)          /* (DWDT_WDT1_ISR) Reload Command Error Status (cleared on read) Mask */
#define DWDT_WDT1_ISR_RLDERR(value)           (DWDT_WDT1_ISR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT1_ISR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT1_ISR register */
#define DWDT_WDT1_ISR_Msk                     _UINT32_(0x00000027)                                 /* (DWDT_WDT1_ISR) Register Mask  */


/* -------- DWDT_WDT1_IMR : (DWDT Offset: 0x20) ( R/ 32) Watchdog 1 Interrupt Mask Register -------- */
#define DWDT_WDT1_IMR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT1_IMR) Overflow Period Interrupt Mask Position */
#define DWDT_WDT1_IMR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IMR_PERINT_Pos)          /* (DWDT_WDT1_IMR) Overflow Period Interrupt Mask Mask */
#define DWDT_WDT1_IMR_PERINT(value)           (DWDT_WDT1_IMR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT1_IMR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT1_IMR register */
#define DWDT_WDT1_IMR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT1_IMR) Reload Repeat Period Interrupt Mask Position */
#define DWDT_WDT1_IMR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT1_IMR_RPTHINT_Pos)         /* (DWDT_WDT1_IMR) Reload Repeat Period Interrupt Mask Mask */
#define DWDT_WDT1_IMR_RPTHINT(value)          (DWDT_WDT1_IMR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT1_IMR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT1_IMR register */
#define DWDT_WDT1_IMR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT1_IMR) Interrupt Level Threshold Interrupt Mask Position */
#define DWDT_WDT1_IMR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT1_IMR_LVLINT_Pos)          /* (DWDT_WDT1_IMR) Interrupt Level Threshold Interrupt Mask Mask */
#define DWDT_WDT1_IMR_LVLINT(value)           (DWDT_WDT1_IMR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT1_IMR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT1_IMR register */
#define DWDT_WDT1_IMR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT1_IMR) Reload Command Error Interrupt Mask Position */
#define DWDT_WDT1_IMR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT1_IMR_RLDERR_Pos)          /* (DWDT_WDT1_IMR) Reload Command Error Interrupt Mask Mask */
#define DWDT_WDT1_IMR_RLDERR(value)           (DWDT_WDT1_IMR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT1_IMR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT1_IMR register */
#define DWDT_WDT1_IMR_Msk                     _UINT32_(0x00000027)                                 /* (DWDT_WDT1_IMR) Register Mask  */


/* -------- DWDT_WDT0_CR : (DWDT Offset: 0x1210) ( /W 32) Watchdog 0 Control Register -------- */
#define DWDT_WDT0_CR_WDRSTT_Pos               _UINT32_(0)                                          /* (DWDT_WDT0_CR) Watchdog Restart Position */
#define DWDT_WDT0_CR_WDRSTT_Msk               (_UINT32_(0x1) << DWDT_WDT0_CR_WDRSTT_Pos)           /* (DWDT_WDT0_CR) Watchdog Restart Mask */
#define DWDT_WDT0_CR_WDRSTT(value)            (DWDT_WDT0_CR_WDRSTT_Msk & (_UINT32_(value) << DWDT_WDT0_CR_WDRSTT_Pos)) /* Assigment of value for WDRSTT in the DWDT_WDT0_CR register */
#define DWDT_WDT0_CR_LOCKMR_Pos               _UINT32_(4)                                          /* (DWDT_WDT0_CR) Lock Mode Register Write Access Position */
#define DWDT_WDT0_CR_LOCKMR_Msk               (_UINT32_(0x1) << DWDT_WDT0_CR_LOCKMR_Pos)           /* (DWDT_WDT0_CR) Lock Mode Register Write Access Mask */
#define DWDT_WDT0_CR_LOCKMR(value)            (DWDT_WDT0_CR_LOCKMR_Msk & (_UINT32_(value) << DWDT_WDT0_CR_LOCKMR_Pos)) /* Assigment of value for LOCKMR in the DWDT_WDT0_CR register */
#define DWDT_WDT0_CR_KEY_Pos                  _UINT32_(24)                                         /* (DWDT_WDT0_CR) Password Position */
#define DWDT_WDT0_CR_KEY_Msk                  (_UINT32_(0xFF) << DWDT_WDT0_CR_KEY_Pos)             /* (DWDT_WDT0_CR) Password Mask */
#define DWDT_WDT0_CR_KEY(value)               (DWDT_WDT0_CR_KEY_Msk & (_UINT32_(value) << DWDT_WDT0_CR_KEY_Pos)) /* Assigment of value for KEY in the DWDT_WDT0_CR register */
#define   DWDT_WDT0_CR_KEY_PASSWD_Val         _UINT32_(0xA5)                                       /* (DWDT_WDT0_CR) Writing any other value in this field aborts the write operation.  */
#define DWDT_WDT0_CR_KEY_PASSWD               (DWDT_WDT0_CR_KEY_PASSWD_Val << DWDT_WDT0_CR_KEY_Pos) /* (DWDT_WDT0_CR) Writing any other value in this field aborts the write operation. Position  */
#define DWDT_WDT0_CR_Msk                      _UINT32_(0xFF000011)                                 /* (DWDT_WDT0_CR) Register Mask  */


/* -------- DWDT_WDT0_MR : (DWDT Offset: 0x1214) (R/W 32) Watchdog 0 Mode Register -------- */
#define DWDT_WDT0_MR_PERIODRST_Pos            _UINT32_(4)                                          /* (DWDT_WDT0_MR) Period Reset Position */
#define DWDT_WDT0_MR_PERIODRST_Msk            (_UINT32_(0x1) << DWDT_WDT0_MR_PERIODRST_Pos)        /* (DWDT_WDT0_MR) Period Reset Mask */
#define DWDT_WDT0_MR_PERIODRST(value)         (DWDT_WDT0_MR_PERIODRST_Msk & (_UINT32_(value) << DWDT_WDT0_MR_PERIODRST_Pos)) /* Assigment of value for PERIODRST in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_RPTHRST_Pos              _UINT32_(5)                                          /* (DWDT_WDT0_MR) Repeat Threshold Reset Position */
#define DWDT_WDT0_MR_RPTHRST_Msk              (_UINT32_(0x1) << DWDT_WDT0_MR_RPTHRST_Pos)          /* (DWDT_WDT0_MR) Repeat Threshold Reset Mask */
#define DWDT_WDT0_MR_RPTHRST(value)           (DWDT_WDT0_MR_RPTHRST_Msk & (_UINT32_(value) << DWDT_WDT0_MR_RPTHRST_Pos)) /* Assigment of value for RPTHRST in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_WDNRSTDIS_Pos            _UINT32_(9)                                          /* (DWDT_WDT0_MR) Watchdog NRST Disable Position */
#define DWDT_WDT0_MR_WDNRSTDIS_Msk            (_UINT32_(0x1) << DWDT_WDT0_MR_WDNRSTDIS_Pos)        /* (DWDT_WDT0_MR) Watchdog NRST Disable Mask */
#define DWDT_WDT0_MR_WDNRSTDIS(value)         (DWDT_WDT0_MR_WDNRSTDIS_Msk & (_UINT32_(value) << DWDT_WDT0_MR_WDNRSTDIS_Pos)) /* Assigment of value for WDNRSTDIS in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_WDDIS_Pos                _UINT32_(12)                                         /* (DWDT_WDT0_MR) Watchdog Disable Position */
#define DWDT_WDT0_MR_WDDIS_Msk                (_UINT32_(0x1) << DWDT_WDT0_MR_WDDIS_Pos)            /* (DWDT_WDT0_MR) Watchdog Disable Mask */
#define DWDT_WDT0_MR_WDDIS(value)             (DWDT_WDT0_MR_WDDIS_Msk & (_UINT32_(value) << DWDT_WDT0_MR_WDDIS_Pos)) /* Assigment of value for WDDIS in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_WDIDLEHLT_Pos            _UINT32_(28)                                         /* (DWDT_WDT0_MR) Watchdog Idle Halt Position */
#define DWDT_WDT0_MR_WDIDLEHLT_Msk            (_UINT32_(0x1) << DWDT_WDT0_MR_WDIDLEHLT_Pos)        /* (DWDT_WDT0_MR) Watchdog Idle Halt Mask */
#define DWDT_WDT0_MR_WDIDLEHLT(value)         (DWDT_WDT0_MR_WDIDLEHLT_Msk & (_UINT32_(value) << DWDT_WDT0_MR_WDIDLEHLT_Pos)) /* Assigment of value for WDIDLEHLT in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_WDDBG0HLT_Pos            _UINT32_(29)                                         /* (DWDT_WDT0_MR) Watchdog Core 0 Debug Halt Position */
#define DWDT_WDT0_MR_WDDBG0HLT_Msk            (_UINT32_(0x1) << DWDT_WDT0_MR_WDDBG0HLT_Pos)        /* (DWDT_WDT0_MR) Watchdog Core 0 Debug Halt Mask */
#define DWDT_WDT0_MR_WDDBG0HLT(value)         (DWDT_WDT0_MR_WDDBG0HLT_Msk & (_UINT32_(value) << DWDT_WDT0_MR_WDDBG0HLT_Pos)) /* Assigment of value for WDDBG0HLT in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_WDDBG1HLT_Pos            _UINT32_(30)                                         /* (DWDT_WDT0_MR) Watchdog Core 1 Debug Halt Position */
#define DWDT_WDT0_MR_WDDBG1HLT_Msk            (_UINT32_(0x1) << DWDT_WDT0_MR_WDDBG1HLT_Pos)        /* (DWDT_WDT0_MR) Watchdog Core 1 Debug Halt Mask */
#define DWDT_WDT0_MR_WDDBG1HLT(value)         (DWDT_WDT0_MR_WDDBG1HLT_Msk & (_UINT32_(value) << DWDT_WDT0_MR_WDDBG1HLT_Pos)) /* Assigment of value for WDDBG1HLT in the DWDT_WDT0_MR register */
#define DWDT_WDT0_MR_Msk                      _UINT32_(0x70001230)                                 /* (DWDT_WDT0_MR) Register Mask  */


/* -------- DWDT_WDT0_VR : (DWDT Offset: 0x1218) ( R/ 32) Watchdog 0 Value Register -------- */
#define DWDT_WDT0_VR_COUNTER_Pos              _UINT32_(0)                                          /* (DWDT_WDT0_VR) Watchdog Down Counter Value Position */
#define DWDT_WDT0_VR_COUNTER_Msk              (_UINT32_(0xFFF) << DWDT_WDT0_VR_COUNTER_Pos)        /* (DWDT_WDT0_VR) Watchdog Down Counter Value Mask */
#define DWDT_WDT0_VR_COUNTER(value)           (DWDT_WDT0_VR_COUNTER_Msk & (_UINT32_(value) << DWDT_WDT0_VR_COUNTER_Pos)) /* Assigment of value for COUNTER in the DWDT_WDT0_VR register */
#define DWDT_WDT0_VR_Msk                      _UINT32_(0x00000FFF)                                 /* (DWDT_WDT0_VR) Register Mask  */


/* -------- DWDT_WDT0_WL : (DWDT Offset: 0x121C) (R/W 32) Watchdog 0 Window Level -------- */
#define DWDT_WDT0_WL_PERIOD_Pos               _UINT32_(0)                                          /* (DWDT_WDT0_WL) Watchdog Period Position */
#define DWDT_WDT0_WL_PERIOD_Msk               (_UINT32_(0xFFF) << DWDT_WDT0_WL_PERIOD_Pos)         /* (DWDT_WDT0_WL) Watchdog Period Mask */
#define DWDT_WDT0_WL_PERIOD(value)            (DWDT_WDT0_WL_PERIOD_Msk & (_UINT32_(value) << DWDT_WDT0_WL_PERIOD_Pos)) /* Assigment of value for PERIOD in the DWDT_WDT0_WL register */
#define DWDT_WDT0_WL_RPTH_Pos                 _UINT32_(16)                                         /* (DWDT_WDT0_WL) Repeat Threshold Position */
#define DWDT_WDT0_WL_RPTH_Msk                 (_UINT32_(0xFFF) << DWDT_WDT0_WL_RPTH_Pos)           /* (DWDT_WDT0_WL) Repeat Threshold Mask */
#define DWDT_WDT0_WL_RPTH(value)              (DWDT_WDT0_WL_RPTH_Msk & (_UINT32_(value) << DWDT_WDT0_WL_RPTH_Pos)) /* Assigment of value for RPTH in the DWDT_WDT0_WL register */
#define DWDT_WDT0_WL_Msk                      _UINT32_(0x0FFF0FFF)                                 /* (DWDT_WDT0_WL) Register Mask  */


/* -------- DWDT_WDT0_IL : (DWDT Offset: 0x1220) (R/W 32) Watchdog 0 Interrupt Level -------- */
#define DWDT_WDT0_IL_LVLTH_Pos                _UINT32_(0)                                          /* (DWDT_WDT0_IL) Level Threshold Position */
#define DWDT_WDT0_IL_LVLTH_Msk                (_UINT32_(0xFFF) << DWDT_WDT0_IL_LVLTH_Pos)          /* (DWDT_WDT0_IL) Level Threshold Mask */
#define DWDT_WDT0_IL_LVLTH(value)             (DWDT_WDT0_IL_LVLTH_Msk & (_UINT32_(value) << DWDT_WDT0_IL_LVLTH_Pos)) /* Assigment of value for LVLTH in the DWDT_WDT0_IL register */
#define DWDT_WDT0_IL_PRESC_Pos                _UINT32_(16)                                         /* (DWDT_WDT0_IL) Prescaler Ratio Position */
#define DWDT_WDT0_IL_PRESC_Msk                (_UINT32_(0x7) << DWDT_WDT0_IL_PRESC_Pos)            /* (DWDT_WDT0_IL) Prescaler Ratio Mask */
#define DWDT_WDT0_IL_PRESC(value)             (DWDT_WDT0_IL_PRESC_Msk & (_UINT32_(value) << DWDT_WDT0_IL_PRESC_Pos)) /* Assigment of value for PRESC in the DWDT_WDT0_IL register */
#define   DWDT_WDT0_IL_PRESC_RATIO128_Val     _UINT32_(0x0)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 128.  */
#define   DWDT_WDT0_IL_PRESC_RATIO64_Val      _UINT32_(0x1)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 64.  */
#define   DWDT_WDT0_IL_PRESC_RATIO32_Val      _UINT32_(0x2)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 32.  */
#define   DWDT_WDT0_IL_PRESC_RATIO16_Val      _UINT32_(0x3)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 16.  */
#define   DWDT_WDT0_IL_PRESC_RATIO8_Val       _UINT32_(0x4)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 8.  */
#define   DWDT_WDT0_IL_PRESC_RATIO4_Val       _UINT32_(0x5)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 4.  */
#define   DWDT_WDT0_IL_PRESC_RATIO2_Val       _UINT32_(0x6)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 2.  */
#define   DWDT_WDT0_IL_PRESC_RATIO1_Val       _UINT32_(0x7)                                        /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 1.  */
#define DWDT_WDT0_IL_PRESC_RATIO128           (DWDT_WDT0_IL_PRESC_RATIO128_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 128. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO64            (DWDT_WDT0_IL_PRESC_RATIO64_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 64. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO32            (DWDT_WDT0_IL_PRESC_RATIO32_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 32. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO16            (DWDT_WDT0_IL_PRESC_RATIO16_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 16. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO8             (DWDT_WDT0_IL_PRESC_RATIO8_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 8. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO4             (DWDT_WDT0_IL_PRESC_RATIO4_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 4. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO2             (DWDT_WDT0_IL_PRESC_RATIO2_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 2. Position  */
#define DWDT_WDT0_IL_PRESC_RATIO1             (DWDT_WDT0_IL_PRESC_RATIO1_Val << DWDT_WDT0_IL_PRESC_Pos) /* (DWDT_WDT0_IL) The watchdog counter decreased when the prescaler reaches 1. Position  */
#define DWDT_WDT0_IL_Msk                      _UINT32_(0x00070FFF)                                 /* (DWDT_WDT0_IL) Register Mask  */


/* -------- DWDT_WDT0_IER : (DWDT Offset: 0x1224) ( /W 32) Watchdog 0 Interrupt Enable Register -------- */
#define DWDT_WDT0_IER_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT0_IER) Overflow Period Interrupt Enable Position */
#define DWDT_WDT0_IER_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IER_PERINT_Pos)          /* (DWDT_WDT0_IER) Overflow Period Interrupt Enable Mask */
#define DWDT_WDT0_IER_PERINT(value)           (DWDT_WDT0_IER_PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IER_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT0_IER) Reload Repeat Period Interrupt Enable Position */
#define DWDT_WDT0_IER_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT0_IER_RPTHINT_Pos)         /* (DWDT_WDT0_IER) Reload Repeat Period Interrupt Enable Mask */
#define DWDT_WDT0_IER_RPTHINT(value)          (DWDT_WDT0_IER_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IER_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT0_IER) Interrupt Level Threshold Interrupt Enable Position */
#define DWDT_WDT0_IER_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IER_LVLINT_Pos)          /* (DWDT_WDT0_IER) Interrupt Level Threshold Interrupt Enable Mask */
#define DWDT_WDT0_IER_LVLINT(value)           (DWDT_WDT0_IER_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT0_IER_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_W1PERINT_Pos            _UINT32_(3)                                          /* (DWDT_WDT0_IER) Watchdog 1 Overflow Interrupt Enable Position */
#define DWDT_WDT0_IER_W1PERINT_Msk            (_UINT32_(0x1) << DWDT_WDT0_IER_W1PERINT_Pos)        /* (DWDT_WDT0_IER) Watchdog 1 Overflow Interrupt Enable Mask */
#define DWDT_WDT0_IER_W1PERINT(value)         (DWDT_WDT0_IER_W1PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IER_W1PERINT_Pos)) /* Assigment of value for W1PERINT in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_W1RPTHINT_Pos           _UINT32_(4)                                          /* (DWDT_WDT0_IER) Watchdog 1 Repeat Threshold Interrupt Enable Position */
#define DWDT_WDT0_IER_W1RPTHINT_Msk           (_UINT32_(0x1) << DWDT_WDT0_IER_W1RPTHINT_Pos)       /* (DWDT_WDT0_IER) Watchdog 1 Repeat Threshold Interrupt Enable Mask */
#define DWDT_WDT0_IER_W1RPTHINT(value)        (DWDT_WDT0_IER_W1RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IER_W1RPTHINT_Pos)) /* Assigment of value for W1RPTHINT in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT0_IER) Reload Command Error Interrupt Enable Position */
#define DWDT_WDT0_IER_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT0_IER_RLDERR_Pos)          /* (DWDT_WDT0_IER) Reload Command Error Interrupt Enable Mask */
#define DWDT_WDT0_IER_RLDERR(value)           (DWDT_WDT0_IER_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT0_IER_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT0_IER register */
#define DWDT_WDT0_IER_Msk                     _UINT32_(0x0000003F)                                 /* (DWDT_WDT0_IER) Register Mask  */


