Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/dwdt.h
/* -------- DWDT_WDT0_IDR : (DWDT Offset: 0x1228) ( /W 32) Watchdog 0 Interrupt Disable Register -------- */
#define DWDT_WDT0_IDR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT0_IDR) Overflow Period Interrupt Disable Position */
#define DWDT_WDT0_IDR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IDR_PERINT_Pos)          /* (DWDT_WDT0_IDR) Overflow Period Interrupt Disable Mask */
#define DWDT_WDT0_IDR_PERINT(value)           (DWDT_WDT0_IDR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT0_IDR) Reload Repeat Period Interrupt Disable Position */
#define DWDT_WDT0_IDR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT0_IDR_RPTHINT_Pos)         /* (DWDT_WDT0_IDR) Reload Repeat Period Interrupt Disable Mask */
#define DWDT_WDT0_IDR_RPTHINT(value)          (DWDT_WDT0_IDR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT0_IDR) Interrupt Level Threshold Interrupt Disable Position */
#define DWDT_WDT0_IDR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IDR_LVLINT_Pos)          /* (DWDT_WDT0_IDR) Interrupt Level Threshold Interrupt Disable Mask */
#define DWDT_WDT0_IDR_LVLINT(value)           (DWDT_WDT0_IDR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_W1PERINT_Pos            _UINT32_(3)                                          /* (DWDT_WDT0_IDR) Watchdog 1 Overflow Interrupt Disable Position */
#define DWDT_WDT0_IDR_W1PERINT_Msk            (_UINT32_(0x1) << DWDT_WDT0_IDR_W1PERINT_Pos)        /* (DWDT_WDT0_IDR) Watchdog 1 Overflow Interrupt Disable Mask */
#define DWDT_WDT0_IDR_W1PERINT(value)         (DWDT_WDT0_IDR_W1PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_W1PERINT_Pos)) /* Assigment of value for W1PERINT in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_W1RPTHINT_Pos           _UINT32_(4)                                          /* (DWDT_WDT0_IDR) Watchdog 1 Repeat Threshold Interrupt Disable Position */
#define DWDT_WDT0_IDR_W1RPTHINT_Msk           (_UINT32_(0x1) << DWDT_WDT0_IDR_W1RPTHINT_Pos)       /* (DWDT_WDT0_IDR) Watchdog 1 Repeat Threshold Interrupt Disable Mask */
#define DWDT_WDT0_IDR_W1RPTHINT(value)        (DWDT_WDT0_IDR_W1RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_W1RPTHINT_Pos)) /* Assigment of value for W1RPTHINT in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT0_IDR) Reload Command Error Interrupt Disable Position */
#define DWDT_WDT0_IDR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT0_IDR_RLDERR_Pos)          /* (DWDT_WDT0_IDR) Reload Command Error Interrupt Disable Mask */
#define DWDT_WDT0_IDR_RLDERR(value)           (DWDT_WDT0_IDR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT0_IDR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT0_IDR register */
#define DWDT_WDT0_IDR_Msk                     _UINT32_(0x0000003F)                                 /* (DWDT_WDT0_IDR) Register Mask  */


/* -------- DWDT_WDT0_ISR : (DWDT Offset: 0x122C) ( R/ 32) Watchdog 0 Interrupt Status Register -------- */
#define DWDT_WDT0_ISR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT0_ISR) Overflow Period Status (cleared on read) Position */
#define DWDT_WDT0_ISR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_ISR_PERINT_Pos)          /* (DWDT_WDT0_ISR) Overflow Period Status (cleared on read) Mask */
#define DWDT_WDT0_ISR_PERINT(value)           (DWDT_WDT0_ISR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT0_ISR) Reload Repeat Period Status (cleared on read) Position */
#define DWDT_WDT0_ISR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT0_ISR_RPTHINT_Pos)         /* (DWDT_WDT0_ISR) Reload Repeat Period Status (cleared on read) Mask */
#define DWDT_WDT0_ISR_RPTHINT(value)          (DWDT_WDT0_ISR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT0_ISR) Interrupt Level Threshold Status (cleared on read) Position */
#define DWDT_WDT0_ISR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_ISR_LVLINT_Pos)          /* (DWDT_WDT0_ISR) Interrupt Level Threshold Status (cleared on read) Mask */
#define DWDT_WDT0_ISR_LVLINT(value)           (DWDT_WDT0_ISR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_W1PERINT_Pos            _UINT32_(3)                                          /* (DWDT_WDT0_ISR) Watchdog 1 Overflow Interrupt Status Position */
#define DWDT_WDT0_ISR_W1PERINT_Msk            (_UINT32_(0x1) << DWDT_WDT0_ISR_W1PERINT_Pos)        /* (DWDT_WDT0_ISR) Watchdog 1 Overflow Interrupt Status Mask */
#define DWDT_WDT0_ISR_W1PERINT(value)         (DWDT_WDT0_ISR_W1PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_W1PERINT_Pos)) /* Assigment of value for W1PERINT in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_W1RPTHINT_Pos           _UINT32_(4)                                          /* (DWDT_WDT0_ISR) Watchdog 1 Repeat Threshold Interrupt Status Position */
#define DWDT_WDT0_ISR_W1RPTHINT_Msk           (_UINT32_(0x1) << DWDT_WDT0_ISR_W1RPTHINT_Pos)       /* (DWDT_WDT0_ISR) Watchdog 1 Repeat Threshold Interrupt Status Mask */
#define DWDT_WDT0_ISR_W1RPTHINT(value)        (DWDT_WDT0_ISR_W1RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_W1RPTHINT_Pos)) /* Assigment of value for W1RPTHINT in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT0_ISR) Reload Command Error Status (cleared on read) Position */
#define DWDT_WDT0_ISR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT0_ISR_RLDERR_Pos)          /* (DWDT_WDT0_ISR) Reload Command Error Status (cleared on read) Mask */
#define DWDT_WDT0_ISR_RLDERR(value)           (DWDT_WDT0_ISR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT0_ISR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT0_ISR register */
#define DWDT_WDT0_ISR_Msk                     _UINT32_(0x0000003F)                                 /* (DWDT_WDT0_ISR) Register Mask  */


/* -------- DWDT_WDT0_IMR : (DWDT Offset: 0x1230) ( R/ 32) Watchdog 0 Interrupt Mask Register -------- */
#define DWDT_WDT0_IMR_PERINT_Pos              _UINT32_(0)                                          /* (DWDT_WDT0_IMR) Overflow Period Interrupt Mask Position */
#define DWDT_WDT0_IMR_PERINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IMR_PERINT_Pos)          /* (DWDT_WDT0_IMR) Overflow Period Interrupt Mask Mask */
#define DWDT_WDT0_IMR_PERINT(value)           (DWDT_WDT0_IMR_PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_PERINT_Pos)) /* Assigment of value for PERINT in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_RPTHINT_Pos             _UINT32_(1)                                          /* (DWDT_WDT0_IMR) Reload Repeat Period Interrupt Mask Position */
#define DWDT_WDT0_IMR_RPTHINT_Msk             (_UINT32_(0x1) << DWDT_WDT0_IMR_RPTHINT_Pos)         /* (DWDT_WDT0_IMR) Reload Repeat Period Interrupt Mask Mask */
#define DWDT_WDT0_IMR_RPTHINT(value)          (DWDT_WDT0_IMR_RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_RPTHINT_Pos)) /* Assigment of value for RPTHINT in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_LVLINT_Pos              _UINT32_(2)                                          /* (DWDT_WDT0_IMR) Interrupt Level Threshold Interrupt Mask Position */
#define DWDT_WDT0_IMR_LVLINT_Msk              (_UINT32_(0x1) << DWDT_WDT0_IMR_LVLINT_Pos)          /* (DWDT_WDT0_IMR) Interrupt Level Threshold Interrupt Mask Mask */
#define DWDT_WDT0_IMR_LVLINT(value)           (DWDT_WDT0_IMR_LVLINT_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_LVLINT_Pos)) /* Assigment of value for LVLINT in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_W1PERINT_Pos            _UINT32_(3)                                          /* (DWDT_WDT0_IMR) Watchdog 1 Overflow Interrupt Mask Position */
#define DWDT_WDT0_IMR_W1PERINT_Msk            (_UINT32_(0x1) << DWDT_WDT0_IMR_W1PERINT_Pos)        /* (DWDT_WDT0_IMR) Watchdog 1 Overflow Interrupt Mask Mask */
#define DWDT_WDT0_IMR_W1PERINT(value)         (DWDT_WDT0_IMR_W1PERINT_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_W1PERINT_Pos)) /* Assigment of value for W1PERINT in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_W1RPTHINT_Pos           _UINT32_(4)                                          /* (DWDT_WDT0_IMR) Watchdog 1 Repeat Threshold Interrupt Mask Position */
#define DWDT_WDT0_IMR_W1RPTHINT_Msk           (_UINT32_(0x1) << DWDT_WDT0_IMR_W1RPTHINT_Pos)       /* (DWDT_WDT0_IMR) Watchdog 1 Repeat Threshold Interrupt Mask Mask */
#define DWDT_WDT0_IMR_W1RPTHINT(value)        (DWDT_WDT0_IMR_W1RPTHINT_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_W1RPTHINT_Pos)) /* Assigment of value for W1RPTHINT in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_RLDERR_Pos              _UINT32_(5)                                          /* (DWDT_WDT0_IMR) Reload Command Error Interrupt Mask Position */
#define DWDT_WDT0_IMR_RLDERR_Msk              (_UINT32_(0x1) << DWDT_WDT0_IMR_RLDERR_Pos)          /* (DWDT_WDT0_IMR) Reload Command Error Interrupt Mask Mask */
#define DWDT_WDT0_IMR_RLDERR(value)           (DWDT_WDT0_IMR_RLDERR_Msk & (_UINT32_(value) << DWDT_WDT0_IMR_RLDERR_Pos)) /* Assigment of value for RLDERR in the DWDT_WDT0_IMR register */
#define DWDT_WDT0_IMR_Msk                     _UINT32_(0x0000003F)                                 /* (DWDT_WDT0_IMR) Register Mask  */


/* -------- DWDT_WDT1_LVLLIM : (DWDT Offset: 0x1234) (R/W 32) Watchdog 1 Level Limits Register -------- */
#define DWDT_WDT1_LVLLIM_LVLMIN_Pos           _UINT32_(0)                                          /* (DWDT_WDT1_LVLLIM) Minimum Level Position */
#define DWDT_WDT1_LVLLIM_LVLMIN_Msk           (_UINT32_(0xFFF) << DWDT_WDT1_LVLLIM_LVLMIN_Pos)     /* (DWDT_WDT1_LVLLIM) Minimum Level Mask */
#define DWDT_WDT1_LVLLIM_LVLMIN(value)        (DWDT_WDT1_LVLLIM_LVLMIN_Msk & (_UINT32_(value) << DWDT_WDT1_LVLLIM_LVLMIN_Pos)) /* Assigment of value for LVLMIN in the DWDT_WDT1_LVLLIM register */
#define DWDT_WDT1_LVLLIM_LVLMAX_Pos           _UINT32_(16)                                         /* (DWDT_WDT1_LVLLIM) Maximum Level Position */
#define DWDT_WDT1_LVLLIM_LVLMAX_Msk           (_UINT32_(0xFFF) << DWDT_WDT1_LVLLIM_LVLMAX_Pos)     /* (DWDT_WDT1_LVLLIM) Maximum Level Mask */
#define DWDT_WDT1_LVLLIM_LVLMAX(value)        (DWDT_WDT1_LVLLIM_LVLMAX_Msk & (_UINT32_(value) << DWDT_WDT1_LVLLIM_LVLMAX_Pos)) /* Assigment of value for LVLMAX in the DWDT_WDT1_LVLLIM register */
#define DWDT_WDT1_LVLLIM_Msk                  _UINT32_(0x0FFF0FFF)                                 /* (DWDT_WDT1_LVLLIM) Register Mask  */


/* -------- DWDT_WDT1_RLIM : (DWDT Offset: 0x1238) (R/W 32) Watchdog 1 Repeat Limits Register -------- */
#define DWDT_WDT1_RLIM_RPTHMIN_Pos            _UINT32_(0)                                          /* (DWDT_WDT1_RLIM) Minimum Repeat Threshold Position */
#define DWDT_WDT1_RLIM_RPTHMIN_Msk            (_UINT32_(0xFFF) << DWDT_WDT1_RLIM_RPTHMIN_Pos)      /* (DWDT_WDT1_RLIM) Minimum Repeat Threshold Mask */
#define DWDT_WDT1_RLIM_RPTHMIN(value)         (DWDT_WDT1_RLIM_RPTHMIN_Msk & (_UINT32_(value) << DWDT_WDT1_RLIM_RPTHMIN_Pos)) /* Assigment of value for RPTHMIN in the DWDT_WDT1_RLIM register */
#define DWDT_WDT1_RLIM_RPTHMAX_Pos            _UINT32_(16)                                         /* (DWDT_WDT1_RLIM) Maximum Repeat Threshold Position */
#define DWDT_WDT1_RLIM_RPTHMAX_Msk            (_UINT32_(0xFFF) << DWDT_WDT1_RLIM_RPTHMAX_Pos)      /* (DWDT_WDT1_RLIM) Maximum Repeat Threshold Mask */
#define DWDT_WDT1_RLIM_RPTHMAX(value)         (DWDT_WDT1_RLIM_RPTHMAX_Msk & (_UINT32_(value) << DWDT_WDT1_RLIM_RPTHMAX_Pos)) /* Assigment of value for RPTHMAX in the DWDT_WDT1_RLIM register */
#define DWDT_WDT1_RLIM_Msk                    _UINT32_(0x0FFF0FFF)                                 /* (DWDT_WDT1_RLIM) Register Mask  */


/* -------- DWDT_WDT1_PLIM : (DWDT Offset: 0x123C) (R/W 32) Watchdog 1 Period Limits Register -------- */
#define DWDT_WDT1_PLIM_PERMIN_Pos             _UINT32_(0)                                          /* (DWDT_WDT1_PLIM) Minimum Period Position */
#define DWDT_WDT1_PLIM_PERMIN_Msk             (_UINT32_(0xFFF) << DWDT_WDT1_PLIM_PERMIN_Pos)       /* (DWDT_WDT1_PLIM) Minimum Period Mask */
#define DWDT_WDT1_PLIM_PERMIN(value)          (DWDT_WDT1_PLIM_PERMIN_Msk & (_UINT32_(value) << DWDT_WDT1_PLIM_PERMIN_Pos)) /* Assigment of value for PERMIN in the DWDT_WDT1_PLIM register */
#define DWDT_WDT1_PLIM_PERMAX_Pos             _UINT32_(16)                                         /* (DWDT_WDT1_PLIM) Maximum Period Position */
#define DWDT_WDT1_PLIM_PERMAX_Msk             (_UINT32_(0xFFF) << DWDT_WDT1_PLIM_PERMAX_Pos)       /* (DWDT_WDT1_PLIM) Maximum Period Mask */
#define DWDT_WDT1_PLIM_PERMAX(value)          (DWDT_WDT1_PLIM_PERMAX_Msk & (_UINT32_(value) << DWDT_WDT1_PLIM_PERMAX_Pos)) /* Assigment of value for PERMAX in the DWDT_WDT1_PLIM register */
#define DWDT_WDT1_PLIM_Msk                    _UINT32_(0x0FFF0FFF)                                 /* (DWDT_WDT1_PLIM) Register Mask  */


/** \brief DWDT register offsets definitions */
#define DWDT_WDT1_CR_REG_OFST          _UINT32_(0x00)      /* (DWDT_WDT1_CR) Watchdog 1 Control Register Offset */
#define DWDT_WDT1_MR_REG_OFST          _UINT32_(0x04)      /* (DWDT_WDT1_MR) Watchdog 1 Mode Register Offset */
#define DWDT_WDT1_VR_REG_OFST          _UINT32_(0x08)      /* (DWDT_WDT1_VR) Watchdog 1 Value Register Offset */
#define DWDT_WDT1_WL_REG_OFST          _UINT32_(0x0C)      /* (DWDT_WDT1_WL) Watchdog 1 Window Level Register Offset */
#define DWDT_WDT1_IL_REG_OFST          _UINT32_(0x10)      /* (DWDT_WDT1_IL) Watchdog 1 Interrupt Level Register Offset */
#define DWDT_WDT1_IER_REG_OFST         _UINT32_(0x14)      /* (DWDT_WDT1_IER) Watchdog 1 Interrupt Enable Register Offset */
#define DWDT_WDT1_IDR_REG_OFST         _UINT32_(0x18)      /* (DWDT_WDT1_IDR) Watchdog 1 Interrupt Disable Register Offset */
#define DWDT_WDT1_ISR_REG_OFST         _UINT32_(0x1C)      /* (DWDT_WDT1_ISR) Watchdog 1 Interrupt Status Register Offset */
#define DWDT_WDT1_IMR_REG_OFST         _UINT32_(0x20)      /* (DWDT_WDT1_IMR) Watchdog 1 Interrupt Mask Register Offset */
#define DWDT_WDT0_CR_REG_OFST          _UINT32_(0x1210)    /* (DWDT_WDT0_CR) Watchdog 0 Control Register Offset */
#define DWDT_WDT0_MR_REG_OFST          _UINT32_(0x1214)    /* (DWDT_WDT0_MR) Watchdog 0 Mode Register Offset */
#define DWDT_WDT0_VR_REG_OFST          _UINT32_(0x1218)    /* (DWDT_WDT0_VR) Watchdog 0 Value Register Offset */
#define DWDT_WDT0_WL_REG_OFST          _UINT32_(0x121C)    /* (DWDT_WDT0_WL) Watchdog 0 Window Level Offset */
#define DWDT_WDT0_IL_REG_OFST          _UINT32_(0x1220)    /* (DWDT_WDT0_IL) Watchdog 0 Interrupt Level Offset */
#define DWDT_WDT0_IER_REG_OFST         _UINT32_(0x1224)    /* (DWDT_WDT0_IER) Watchdog 0 Interrupt Enable Register Offset */
#define DWDT_WDT0_IDR_REG_OFST         _UINT32_(0x1228)    /* (DWDT_WDT0_IDR) Watchdog 0 Interrupt Disable Register Offset */
#define DWDT_WDT0_ISR_REG_OFST         _UINT32_(0x122C)    /* (DWDT_WDT0_ISR) Watchdog 0 Interrupt Status Register Offset */
#define DWDT_WDT0_IMR_REG_OFST         _UINT32_(0x1230)    /* (DWDT_WDT0_IMR) Watchdog 0 Interrupt Mask Register Offset */
#define DWDT_WDT1_LVLLIM_REG_OFST      _UINT32_(0x1234)    /* (DWDT_WDT1_LVLLIM) Watchdog 1 Level Limits Register Offset */
#define DWDT_WDT1_RLIM_REG_OFST        _UINT32_(0x1238)    /* (DWDT_WDT1_RLIM) Watchdog 1 Repeat Limits Register Offset */
#define DWDT_WDT1_PLIM_REG_OFST        _UINT32_(0x123C)    /* (DWDT_WDT1_PLIM) Watchdog 1 Period Limits Register Offset */

